import { Consonant } from '#/linguistics/alphabet/letters';

const testData = {
    consonants: [
        ["π", "μ", "μμ"], ["β", "μ", "μμ"], ["φ", "μ", "μμ"],
        ["κ", "μ", "γμ"], ["γ", "μ", "γμ"], ["χ", "μ", "γμ"],
        ["τ", "μ", "σμ"], ["δ", "μ", "σμ"], ["θ", "μ", "σμ"], ["ζ", "μ", "σμ"], ["ν", "μ", "σμ"],
        ["π", "σ", "ψ"], ["β", "σ", "ψ"], ["φ", "σ", "ψ"],
        ["κ", "σ", "ξ"], ["γ", "σ", "ξ"], ["χ", "σ", "ξ"],
        ["τ", "σ", "σ"], ["δ", "σ", "σ"], ["θ", "σ", "σ"], ["ζ", "σ", "σ"],
        ["", "", ""],
        ["", "", ""],
        ["", "", ""],
        ["", "", ""],
    ],
    forms: [

    ]
} as {
    consonants: [Consonant, string, string][],
    forms: [string, string, string][];
};

export default testData;